<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-06  0.570008  0.447178 -0.447364 -1.125265

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563 -1.207353

In [8]:
df.tail()

                   A         B         C         D
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-06  0.570008  0.447178 -0.447364 -1.125265

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-06  0.570008  0.447178 -0.447364 -1.125265

In [12]:
df.to_numpy()

array([[-0.37435744,  0.99321358, -0.26544944, -0.83454501],
       [-1.27577767,  0.42825734, -1.28020273, -0.00656364],
       [ 1.79580856, -0.44586244,  1.45386758,  0.22210304],
       [-0.89443643, -0.00596385,  0.7248917 ,  0.18305155],
       [ 0.53084833,  0.80027487,  0.18956305, -1.20735282],
       [ 0.57000836,  0.44717797, -0.44736402, -1.1252653 ]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-06  0.570008  0.447178 -0.447364 -1.125265

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.374357   -1.275778    1.795809   -0.894436    0.530848    0.570008
B    0.993214    0.428257   -0.445862   -0.005964    0.800275    0.447178
C   -0.265449   -1.280203    1.453868    0.724892    0.189563   -0.447364
D   -0.834545   -0.006564    0.222103    0.183052   -1.207353   -1.125265

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-06  0.570008  0.447178 -0.447364 -1.125265

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.834545 -0.265449  0.993214 -0.374357
2013-01-02 -0.006564 -1.280203  0.428257 -1.275778
2013-01-03  0.222103  1.453868 -0.445862  1.795809
2013-01-04  0.183052  0.724892 -0.005964 -0.894436
2013-01-05 -1.207353  0.189563  0.800275  0.530848
2013-01-06 -1.125265 -0.447364  0.447178  0.570008

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-06  0.570008  0.447178 -0.447364 -1.125265
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01   -0.374357
2013-01-02   -1.275778
2013-01-03    1.795809
2013-01-04   -0.894436
2013-01-05    0.530848
2013-01-06    0.570008
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A   -0.374357
B    0.993214
C   -0.265449
D   -0.834545
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.374357  0.993214
2013-01-02 -1.275778  0.428257
2013-01-03  1.795809 -0.445862
2013-01-04 -0.894436 -0.005964
2013-01-05  0.530848  0.800275
2013-01-06  0.570008  0.447178

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02 -1.275778  0.428257
2013-01-03  1.795809 -0.445862
2013-01-04 -0.894436 -0.005964

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A   -1.275778
B    0.428257
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

-0.37435744099176443

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

-0.37435744099176443

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A   -0.894436
B   -0.005964
C    0.724892
D    0.183052
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.894436 -0.005964
2013-01-05  0.530848  0.800275

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.275778 -1.280203
2013-01-03  1.795809  1.453868
2013-01-05  0.530848  0.189563

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.993214 -0.265449
2013-01-02  0.428257 -1.280203
2013-01-03 -0.445862  1.453868
2013-01-04 -0.005964  0.724892
2013-01-05  0.800275  0.189563
2013-01-06  0.447178 -0.447364

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

0.4282573374991304

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

0.4282573374991304

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-06  0.570008  0.447178 -0.447364 -1.125265

In [37]:
df

                   A         B         C         D
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564
2013-01-03  1.795809 -0.445862  1.453868  0.222103
2013-01-04 -0.894436 -0.005964  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563 -1.207353
2013-01-06  0.570008  0.447178 -0.447364 -1.125265

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.993214       NaN       NaN
2013-01-02       NaN  0.428257       NaN       NaN
2013-01-03  1.795809       NaN  1.453868  0.222103
2013-01-04       NaN       NaN  0.724892  0.183052
2013-01-05  0.530848  0.800275  0.189563       NaN
2013-01-06  0.570008  0.447178       NaN       NaN

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545    one
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564    one
2013-01-03  1.795809 -0.445862  1.453868  0.222103    two
2013-01-04 -0.894436 -0.005964  0.724892  0.183052  three
2013-01-05  0.530848  0.800275  0.189563 -1.207353   four
2013-01-06  0.570008  0.447178 -0.447364 -1.125265  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  1.795809 -0.445862  1.453868  0.222103   two
2013-01-05  0.530848  0.800275  0.189563 -1.207353  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01 -0.374357  0.993214 -0.265449 -0.834545  NaN
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564  1.0
2013-01-03  1.795809 -0.445862  1.453868  0.222103  2.0
2013-01-04 -0.894436 -0.005964  0.724892  0.183052  3.0
2013-01-05  0.530848  0.800275  0.189563 -1.207353  4.0
2013-01-06  0.570008  0.447178 -0.447364 -1.125265  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.993214 -0.265449 -0.834545  NaN
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564  1.0
2013-01-03  1.795809 -0.445862  1.453868  0.222103  2.0
2013-01-04 -0.894436 -0.005964  0.724892  0.183052  3.0
2013-01-05  0.530848  0.800275  0.189563 -1.207353  4.0
2013-01-06  0.570008  0.447178 -0.447364 -1.125265  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.265449 -0.834545  NaN
2013-01-02 -1.275778  0.428257 -1.280203 -0.006564  1.0
2013-01-03  1.795809 -0.445862  1.453868  0.222103  2.0
2013-01-04 -0.894436 -0.005964  0.724892  0.183052  3.0
2013-01-05  0.530848  0.800275  0.189563 -1.207353  4.0
2013-01-06  0.570008  0.447178 -0.447364 -1.125265  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.265449  5  NaN
2013-01-02 -1.275778  0.428257 -1.280203  5  1.0
2013-01-03  1.795809 -0.445862  1.453868  5  2.0
2013-01-04 -0.894436 -0.005964  0.724892  5  3.0
2013-01-05  0.530848  0.800275  0.189563  5  4.0
2013-01-06  0.570008  0.447178 -0.447364  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.265449 -5  NaN
2013-01-02 -1.275778 -0.428257 -1.280203 -5 -1.0
2013-01-03 -1.795809 -0.445862 -1.453868 -5 -2.0
2013-01-04 -0.894436 -0.005964 -0.724892 -5 -3.0
2013-01-05 -0.530848 -0.800275 -0.189563 -5 -4.0
2013-01-06 -0.570008 -0.447178 -0.447364 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.265449  5  NaN  1.0
2013-01-02 -1.275778  0.428257 -1.280203  5  1.0  1.0
2013-01-03  1.795809 -0.445862  1.453868  5  2.0  NaN
2013-01-04 -0.894436 -0.005964  0.724892  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [49]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -1.275778  0.428257 -1.280203  5  1.0  1.0

결측치를 채우기

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.265449  5  5.0  1.0
2013-01-02 -1.275778  0.428257 -1.280203  5  1.0  1.0
2013-01-03  1.795809 -0.445862  1.453868  5  2.0  5.0
2013-01-04 -0.894436 -0.005964  0.724892  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [51]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.265449  5  NaN  1.0
2013-01-02 -1.275778  0.428257 -1.280203  5  1.0  1.0
2013-01-03  1.795809 -0.445862  1.453868  5  2.0  NaN
2013-01-04 -0.894436 -0.005964  0.724892  5  3.0  NaN

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Stats

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.265449  5  NaN
2013-01-02 -1.275778  0.428257 -1.280203  5  1.0
2013-01-03  1.795809 -0.445862  1.453868  5  2.0
2013-01-04 -0.894436 -0.005964  0.724892  5  3.0
2013-01-05  0.530848  0.800275  0.189563  5  4.0
2013-01-06  0.570008  0.447178 -0.447364  5  5.0

In [54]:
df.mean()

A    0.121075
B    0.203981
C    0.062551
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(1)

2013-01-01    1.183638
2013-01-02    0.774455
2013-01-03    1.960763
2013-01-04    1.564898
2013-01-05    2.104137
2013-01-06    2.113964
Freq: D, dtype: float64

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

크기가 다르고 정렬이 필요한 객체로 작업합니다.

pandas는 지정된 차원을 따라 자동으로 broadcast합니다.

In [57]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.795809 -1.445862  0.453868  4.0  1.0
2013-01-04 -3.894436 -3.005964 -2.275108  2.0  0.0
2013-01-05 -4.469152 -4.199725 -4.810437  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

In [58]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.265449  5  NaN
2013-01-02 -1.275778  0.428257 -1.280203  5  1.0
2013-01-03  1.795809 -0.445862  1.453868  5  2.0
2013-01-04 -0.894436 -0.005964  0.724892  5  3.0
2013-01-05  0.530848  0.800275  0.189563  5  4.0
2013-01-06  0.570008  0.447178 -0.447364  5  5.0

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.265449   5   NaN
2013-01-02 -1.275778  0.428257 -1.545652  10   1.0
2013-01-03  0.520031 -0.017605 -0.091785  15   3.0
2013-01-04 -0.374406 -0.023569  0.633107  20   6.0
2013-01-05  0.156443  0.776706  0.822670  25  10.0
2013-01-06  0.726451  1.223884  0.375306  30  15.0

In [60]:
df.apply(lambda x : x.max() - x.min())

A    3.071586
B    1.246137
C    2.734070
D    0.000000
F    4.000000
dtype: float64

# Histogramming

In [61]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    5
1    1
2    1
3    4
4    3
5    3
6    4
7    0
8    3
9    1
dtype: int64

In [62]:
s.value_counts()

3    3
1    3
4    2
5    1
0    1
dtype: int64

# String Methods

In [63]:
s = pd.Series(['A', "B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge(병합)

## Concat

pandas는 Series와 DataFrame 객체를 쉽게 결합할 수 있는 다양한 기능을 제공합니다.

Join, Merge 연산의 경우 index와 관계 대수를 위한 다양한 로직을 제공합니다.

In [64]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.665015 -0.061794 -0.395315 -1.055711
1 -2.690179  0.656493 -1.506197  0.153403
2  1.283561 -2.309680  0.759433 -0.636185
3 -0.647910  1.191512  0.150076  1.447196
4  2.515075  0.217684 -0.240471  1.057038
5  1.716685  0.103434  0.004742  1.736422
6 -1.674739 -0.186353 -0.168578 -0.471911
7  0.589801  0.663653 -0.227383 -0.511422
8 -0.825674 -1.003466  0.803155 -1.488126
9  2.192445  0.281882 -1.524797 -0.770528

In [65]:
pieces = [df[:3], df[3:7],df[7:]]
pieces

[          0         1         2         3
 0  0.665015 -0.061794 -0.395315 -1.055711
 1 -2.690179  0.656493 -1.506197  0.153403
 2  1.283561 -2.309680  0.759433 -0.636185,
           0         1         2         3
 3 -0.647910  1.191512  0.150076  1.447196
 4  2.515075  0.217684 -0.240471  1.057038
 5  1.716685  0.103434  0.004742  1.736422
 6 -1.674739 -0.186353 -0.168578 -0.471911,
           0         1         2         3
 7  0.589801  0.663653 -0.227383 -0.511422
 8 -0.825674 -1.003466  0.803155 -1.488126
 9  2.192445  0.281882 -1.524797 -0.770528]

In [66]:
pd.concat(pieces)

          0         1         2         3
0  0.665015 -0.061794 -0.395315 -1.055711
1 -2.690179  0.656493 -1.506197  0.153403
2  1.283561 -2.309680  0.759433 -0.636185
3 -0.647910  1.191512  0.150076  1.447196
4  2.515075  0.217684 -0.240471  1.057038
5  1.716685  0.103434  0.004742  1.736422
6 -1.674739 -0.186353 -0.168578 -0.471911
7  0.589801  0.663653 -0.227383 -0.511422
8 -0.825674 -1.003466  0.803155 -1.488126
9  2.192445  0.281882 -1.524797 -0.770528

## Join

SQL 스타일로 병합이 됩니다.

In [67]:
left = pd.DataFrame({"key" :["foo","foo"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [68]:
right = pd.DataFrame({"key" :["foo","foo"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [69]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

다른 예를 보자면

In [70]:
left = pd.DataFrame({"key" : ["foo","bar"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  bar     2

In [71]:
right = pd.DataFrame({"key" :["foo","bar"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  bar     5

In [72]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5

# Grouping
'group by' 란 다음 단계 중 하나이상을 포함하는 프로세스를 의미합니다.
- 일부 기준에 따라 데이터를 그룹으로 나눕니다.
- 각 그룹에 독립적으로 기능을 적용합니다.
- 결과를 데이터 구조로 결합합니다.

In [73]:
df = pd.DataFrame(
    {
        "A" : ["foo",'bar','foo','bar','foo','bar','foo','foo'],
        "B" : ["one","one","two","three","two",'two','one','three'],
        "C" : np.random.randn(8),
        "D" : np.random.randn(8)
    }
)
df

     A      B         C         D
0  foo    one  0.232151  2.016860
1  bar    one  1.864436  0.320272
2  foo    two  1.113311  0.049894
3  bar  three -0.327346  0.219678
4  foo    two -1.529925  0.454753
5  bar    two -1.168934 -1.165531
6  foo    one  1.071759  0.213883
7  foo  three  0.187831  0.312438

그룹으로 결합후에 sum() 함수를 적용합니다.

In [76]:
df.groupby("A").sum()

            C         D
A
bar  0.368157 -0.625581
foo  1.075127  3.047828